Revit 2027 API
EnergyDataSettings.CheckRangeOfPercentageGlazing Method
 Checks that the percentage glazing value is between 0.00 and 0.95.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckRangeOfPercentageGlazing(
	double percentageGlazing
)
Public Shared Function CheckRangeOfPercentageGlazing (
	percentageGlazing As Double
) As Boolean
public:
static bool CheckRangeOfPercentageGlazing(
	double percentageGlazing
)
static member CheckRangeOfPercentageGlazing :
        percentageGlazing : float -> bool
Parameters
percentageGlazing Double
 The percentage glazing to be checked.
Return Value
Boolean
 True if the percentage glazing value is between 0.00 and 0.95, false otherwise.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace